trade_exp/src/InformationRegisters/ДоговорыПеревозчиков/ДоговорыПеревозчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="89461d73-83ba-4374-929d-b153099f8a7e">
  <name>ДоговорыПеревозчиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="28d667d5-e10b-4712-8a3f-38ea9ae127a4">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="ce960afe-9bab-44eb-9d76-e862ce764b60">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="bd10f69b-1232-4edb-85f5-d68d9016c961">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e29972a0-9e3b-41fa-9f49-ab09fa0904f3">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаПрибыли</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлатежиПо275ФЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничиватьСуммуЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИностранныйИсполнительВУтвержденномПеречнеГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипПлатежаФЗ275</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>УчетАгентскогоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗапрещаетсяПросроченнаяЗадолженность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КоличествоДнейПросрочки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтатусДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РазрешитьОтгрузкуПриПревышении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстДляНазначенияПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e4d6429-3779-415e-a0fd-605e54b909fe">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2ff70d3-ff88-44af-b741-32d672c8125a">
    <name>ПечататьВУПД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e06bae83-ba77-48c9-bb40-159b45c72ed6">
    <name>ОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a0241b3d-6845-4ee6-8b92-3b00a0b4c45c">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd40c379-db06-454d-a768-f757b503f620">
    <name>РазрешенаРаботаСДочернимиПартнерами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="757d135e-2285-42a9-8208-52f29d49e69e">
    <name>ИдентификаторГосКонтракта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ab3f66d-3919-4794-9cb9-5d1357469cd5">
    <name>КомиссионныеПродажи25</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3cce95d9-af7e-4260-8c94-acb4b858ce14">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4260e299-3a49-43df-b15c-e023f1cec2d5">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79844f87-ebb9-4536-bbae-5da8b7904167">
    <name>ВариантВыбытияМаркируемойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПодтверждающиеДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>128</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Файл</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="df10b069-e208-42fb-b04f-d5b5239f320e">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="92a07f04-3acc-4b83-9d37-ef44ee4db151">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cb23b7af-c779-4ad4-99e8-4abfff8b406c">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="90605e38-9973-4892-8b74-198167fdf900">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="73afeb44-37a7-425d-8755-c69ab50eb0b4">
    <name>Филиалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9950309a-c137-45a6-98c6-a27d9b40522b">
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/ДоговорыПеревозчиков/Forms/Док_ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
   Если Не Параметры.ЗначениеКопирования.Перевозчик = Справочники.Партнеры.ПустаяСсылка() И Не РольДоступна ("ПолныеПрава") Тогда
       Отказ = Истина; 
       ВызватьИсключение("Запрещено создавать элементы копированием.");
   Иначе
	Если Запись.Ответственный = Справочники.Пользователи.ПустаяСсылка()                                
		ИЛИ (Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь И День(Запись.Период) = День(ТекущаяДата()))
		ИЛИ РегистрыСведений.ДоговорыПеревозчиков.ЕстьПравоИзмененияРегистраДоговорыПеревозчиков() Тогда
		ЗаполнитьПараметры() 
	Иначе                    
		Отказ = Истина; 
		ВызватьИсключение("Недостаточно прав для редактирования объекта.");
	КонецЕсли	
   КонецЕсли		
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ТолькоТранспортныеДоговоры Тогда 
		СтандартнаяОбработка = Ложь; 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", УстановитьПараметрыОтбора());
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;	
КонецПроцедуры

&НаСервере 
Функция УстановитьПараметрыОтбора()
	КонтрагентОтбора  = Справочники.Контрагенты.НайтиПоНаименованию("Транспортные расходы", 1);
	ОрганизацияОтбора = Справочники.Организации.НайтиПоНаименованию("АСК-Р", 1);
	СтруктураОтбора   = Новый Структура("Контрагент, Организация", КонтрагентОтбора, ОрганизацияОтбора);
	Возврат СтруктураОтбора
КонецФункции

&НаСервере 
Процедура ЗаполнитьПараметры()  
	Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Запись.Период = ТекущаяДата();	
	ДоступностьПолей = РольДоступна("ПолныеПрава");
	Элементы.Ответственный.Доступность = ДоступностьПолей;
	Элементы.Период.Доступность = ДоступностьПолей;   
	ТолькоТранспортныеДоговоры = 1;
КонецПроцедуры
